; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	infrared1 - mode
	thermograph3 - mode
	infrared5 - mode
	image6 - mode
	infrared4 - mode
	Star2 - direction
	Star5 - direction
	Star6 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph3)
	(supports instrument2 image6)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared5)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite0 Star14)
	(pointing satellite1 GroundStation7)
	(have_image Planet8 infrared4)
	(have_image Planet9 spectrograph2)
	(have_image Planet9 infrared5)
	(have_image Star10 spectrograph2)
	(have_image Star10 infrared5)
	(have_image Planet11 thermograph3)
	(have_image Planet11 spectrograph2)
	(have_image Phenomenon12 image6)
	(have_image Star13 image6)
	(have_image Star14 infrared4)
))

)

; plan
1. (turn_to satellite1 groundstation0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 star13 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star13)
   goals met: 0 of 12
5. (take_image satellite1 star13 instrument2 image6)
   added: (have_image star13 image6)
   goals met: 1 of 12
6. (turn_to satellite1 planet11 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet11)
   goals met: 1 of 12
7. (take_image satellite1 planet11 instrument2 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 12
10. (take_image satellite1 phenomenon12 instrument2 image6)
   added: (have_image phenomenon12 image6)
   goals met: 3 of 12
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 12
12. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 3 of 12
13. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 12
14. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 12
15. (turn_to satellite0 planet8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet8)
   goals met: 3 of 12
16. (take_image satellite0 planet8 instrument0 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 4 of 12
17. (turn_to satellite0 star14 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star14)
   goals met: 5 of 12
18. (take_image satellite0 star14 instrument0 infrared4)
   added: (have_image star14 infrared4)
   goals met: 6 of 12
19. (turn_to satellite1 groundstation3 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 groundstation3)
   goals met: 6 of 12
20. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 6 of 12
21. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 6 of 12
22. (take_image satellite1 planet11 instrument3 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 7 of 12
23. (turn_to satellite1 planet9 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet9)
   goals met: 7 of 12
24. (take_image satellite1 planet9 instrument3 infrared5)
   added: (have_image planet9 infrared5)
   goals met: 8 of 12
25. (take_image satellite1 planet9 instrument3 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 9 of 12
26. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 9 of 12
27. (take_image satellite1 star10 instrument3 infrared5)
   added: (have_image star10 infrared5)
   goals met: 10 of 12
28. (take_image satellite1 star10 instrument3 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 11 of 12
29. (turn_to satellite1 groundstation7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation7)
   goals met: 12 of 12
